#!/bin/bash

echo ""
echo "---------------------------------------------------------------------------------------"
echo "|                  /0000000             /000000            /0000000                   |"
echo "|                 | 00__  00           /00__  00          | 00__  00                  |"
echo "|                 | 00  \ 00 /00   /00| 00  \__/  /000000 | 00  \ 00                  |"
echo "|                 | 0000000 | 00  | 00|  000000  /00__  00| 00  | 00                  |"
echo "|                 | 00__  00| 00  | 00 \____  00| 00000000| 00  | 00                  |"
echo "|                 | 00  \ 00| 00  | 00 /00  \ 00| 00_____/| 00  | 00                  |"
echo "|                 | 0000000/|  000000/|  000000/|  0000000| 0000000/                  |"
echo "|                 |_______/  \______/  \______/  \_______/|_______/                   |"
echo "---------------------------------------------------------------------------------------"
echo ""
echo "---------------------------------------------------------------------------------------"
echo "|     BuSeD Versión 1.0   +   Juampa UnD3sc0n0c1d0 Rodríguez   +   Moebiusec Team     |"
echo "---------------------------------------------------------------------------------------"
echo ""

echo "Indica el dominio (target) que deseas evaluar:"
read DO
echo ""
echo "Indica el diccionario que emplearás:"
read SB
echo ""

ID=1
CO=1
LS=$(cat $SB | wc -l)
IFS=$'\n'
echo "SUBDOMINIOS ENCONTRADOS:"
echo "-------------------------------------------"
	for LSB in $(cat $SB);
	do PN=$(ping -c 2 $LSB.$DO 2>&1);
	AV=$(($CO*100/$LS))
		if [[ $PN = *icmp_seq* ]];
		then
		echo "  "$ID": "$LSB.$DO "| Avance:" $AV"%"
	ID=$(($ID+1))
	echo $LSB.$DO >> Resultados.txt
		fi
	CO=$(($CO+1))
	done
echo "-------------------------------------------"
echo ""
echo "---------------------------------------------------------------------------------------"
echo "|  Todos los Subdominios encontrados fueron guardados en el fichero.- Resultados.txt  |"
echo "---------------------------------------------------------------------------------------"
echo ""
